# Updating Rows and Columns

In [1]:
import pandas as pd
import numpy as np

In [137]:
#  dummy dictionary to convert it into dataframe

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 32, 18, 47],
    'shape': ['New York', 'Paris', 'London', 'San Francisco'],
    'salary':[10000,120000,125000,105000]
}

In [138]:
data = pd.DataFrame(data)

In [3]:
df = pd.read_csv("CSVs\survey_results_public.csv")

## Changing Names of all the columns at once

In [8]:
# Let's first look at all the columns in our dummy data
data.columns

Index(['name', 'age', 'shape'], dtype='object')

In [23]:
# changing names of all the columns at once,
# Let's say I want to change the column name "shape" from "city" and I want to change "name" to "full_name" and
# keep age column same
# but the syntax below takes all column name, and if we want to change some specific column name we can do it with
# another syntax that we will talk later (without passing all column names)

data.columns = ["full_name", "age", "city"]

In [24]:
data.columns
# If I look into my data, column names are changed

Index(['full_name', 'age', 'city'], dtype='object')

## Altering something in all column names using list comprehension and str class of pandas
Let's say we want to upper case all the column names or, replace the spaces with the underscore, we can do it using the list comprehension, as well as str class   
- upper()  
- lower()  
- len()  
- title()  
- strip()    
- lstrip()  
- rstring()  
- replace()  
- split()  
- removesuffix()  
- removeprefix()  
- cat()  

We can use multiple useful methods from str class and useful link is below
https://pandas.pydata.org/docs/reference/api/pandas.Series.str.title.html
complete str class


https://pandas.pydata.org/docs/user_guide/text.html

In [25]:
data.columns = [x.upper() for x in data.columns]

In [26]:
data.columns

Index(['FULL_NAME', 'AGE', 'CITY'], dtype='object')

In [27]:
# WE can do the same thing using the str class of pandas

In [28]:
data.columns = data.columns.str.lower()
data.columns

Index(['full_name', 'age', 'city'], dtype='object')

## Altering the column names, by removing spaces and replacing them with _ or vice versa
For this purpose, we can use the list comprehension, but str class of pandas can do this work in more simpler syntax but we will explore both

In [29]:
# Let's first try it with List comprehension 
data.columns = [x.replace("_"," ") for x in data.columns]
data.columns

Index(['full name', 'age', 'city'], dtype='object')

In [30]:
# But I want to keep it same so, I will replace it back to the underscore, because 
# we cannot use dot notaion to access specific column of the dataframe if there is space in the column name
# And I will do this using the str class
data.columns = data.columns.str.replace(" ","_")
data.columns

Index(['full_name', 'age', 'city'], dtype='object')

## Renaming specific column names
We will use the rename() function and we need to set the "inplace" argument to "True" otherwise pandas will not replace the names of the columns on the original dataset, 
We need to pass the dictionary to the "columns" argument of rename method and pass the old name as key and new name as value

In [31]:
data.rename(columns={"first_name":"name"})
# if I look into the dataframe, pandas didnot change anything so we need to use the "inplace" argument

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2   Charlie   18         London
3     David   47  San Francisco

In [34]:
data.rename(columns={"first_name":"name"}, inplace=True)
data.columns

Index(['full_name', 'age', 'city'], dtype='object')

## Updating all values of particular row

In [37]:
# Let's say I want to update the row 2 ["Charles", 18, "London"]
data.loc[2] = ["Mike", 18 , "Amesterdam"]

In [38]:
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2      Mike   18     Amesterdam
3     David   47  San Francisco

## Updating specific column values for a single row
For this task we are familiar with the syntax

In [39]:
data.loc[2, ["full_name", "city"]] = ["Charles", "London"]

# By using this syntax we are telling pandas, the access the "full_name" and "city" columns and set their values

In [40]:
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2   Charles   18         London
3     David   47  San Francisco

In [41]:
# Changing single value
data.loc[2, "full_name"] = "Mike"
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2      Mike   18         London
3     David   47  San Francisco

## at[] operator
Similar to loc, in that both provide label-based lookups. Use at if you only need to get or set a single value in a DataFrame or Series.

According to pandas documentation it is similar to the "loc" operator, and this operator is not deprecated yet, It means there could be a chance like "at" operator is more optimized to access single records than the loc but not sure (Instructors views)

- Main difference is, loc can handle single and multiple values but at can only handle single values

In [59]:
data.at[2, "full_name"] = "Charles"
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2   Charles   18         London
3     David   47  San Francisco

## Warning in changing the value of specific column using filter

In [60]:
filt = data[data["full_name"] == "Charles"]
filt

  full_name  age    city
2   Charles   18  London

In [62]:
filt["fullname"] = "Mike"

# doing this way pandas gives us a warning, and the reason behind it can be studied in the documentation below

C:\Users\Meer\AppData\Local\Temp\ipykernel_43084\2820425770.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filt["fullname"] = "Mike"

In [51]:
#but we can update the value this way

filt = (data["full_name"] == "Charles")
print(filt)
data.loc[filt,"full_name"] = "Mike"
data

0    False
1    False
2    False
3    False
Name: full_name, dtype: bool

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2      Mike   18         London
3     David   47  San Francisco

## Changing data of all rows are specific column

In [64]:
data["full_name"].str.lower()

# this only returned the lower case values and didnot change the dataframe

0      alice
1        bob
2    charles
3      david
Name: full_name, dtype: object

In [65]:
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2   Charles   18         London
3     David   47  San Francisco

In [67]:
# To change the values actually in the column we can assign it to that column
data["full_name"]= data["full_name"].str.lower()
data

  full_name  age           city
0     alice   25       New York
1       bob   32          Paris
2   charles   18         London
3     david   47  San Francisco

In [68]:
data["full_name"]= data["full_name"].str.title()
data

  full_name  age           city
0     Alice   25       New York
1       Bob   32          Paris
2   Charles   18         London
3     David   47  San Francisco

## Useful 4 methods to change the values of specific columns for all the rows like making full_name column values into lower case  

1. apply
2. map
3. applymap
4. replace

### apply() function

#### APPLICATION OF APPLY FUNCTION FOR THE SERIES OBJECT

- Doc string of apply()
    - Apply a function along an axis of the DataFrame.Apply a function along an axis of the DataFrame.
        Objects passed to the function are Series objects whose index is
        either the DataFrame's index (``axis=0``) or the DataFrame's columns
        (``axis=1``). By default (``result_type=None``), the final return type
        is inferred from the return type of the applied function. Otherwise,
        it depends on the `result_type` argument.

In [70]:
# These are important function and have complex results so we need to give full attention on how these function work
# Let's start with apply function


data.full_name.apply(len)

# this is giving the number of character from the "full_name" column of all the rows, 
# e.g "Alice" has 5 characters
# "Bob" has 3 etc.

0    5
1    3
2    7
3    5
Name: full_name, dtype: int64

In [71]:
# we can pass our custom built function as well 

def make_upper(col):
    return col.upper()

In [72]:
data["full_name"].apply(make_upper)

# This is giving me the upper case version of column "full_name" for all rows
# Important thing to mention here is, it is not modifying our dataset, to modify the dataset we need to assign full_name column
# to the result of the apply function

0      ALICE
1        BOB
2    CHARLES
3      DAVID
Name: full_name, dtype: object

In [ ]:
# like this but I will not execute this cell
data["full_name"] = data["full_name"].apply(make_upper)

In [73]:
# we can also use lambda function in the apply function 

data["full_name"].apply(lambda x: x.upper())

0      ALICE
1        BOB
2    CHARLES
3      DAVID
Name: full_name, dtype: object

#### APPLICATION OF APPLY FUNCTION FOR THE DATAFRAME OBJECT

In [75]:
data.apply(len)

# This might confuse use, because application of "apply()" function on the series object gives us the lenght of all the 
# values in specified column for all the  rows BUT
# for the DataFrames, it is giving us the number of values/ or count of values that each column holds e.g.
# "full_name" has 4 values it has length of 4
# "age" column has 4 values it has length of 4 etc. 

# More specifically saying, It is returning us number of rows for each column

full_name    4
age          4
city         4
dtype: int64

In [80]:
# NOW, let's change the axis argument of apply() to the "columns" by default it is set on "rows"
# For axis default as "rows", apply function works from top 2 bottom , 
# For axis set as "columns" apply() works on left to right for all rows

data.apply(len, axis="columns")

# Now, it is giving me the number of columns for all the rows, like row with index 0 has 3 columns and so on

0    3
1    3
2    3
3    3
dtype: int64

In [81]:
# let's apply the min() function on dataframe

data.apply(min)

full_name     Alice
age              18
city         London
dtype: object

In [82]:
# OR we can use the pd.Series.min function as well its the pandas function
data.apply(pd.Series.min)

# Results are same, Now it is set on the "rows" axis, and the output is from top to bottom 
# So it is giving me the minimum values from all rows, or we can say that, minimum value of each column

full_name     Alice
age              18
city         London
dtype: object

In [83]:
df2 = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])

In [92]:
df2.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [95]:
df2.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [98]:
df2.apply(np.sum, axis=0)
# default axis is 0 which is rows

A    12
B    27
dtype: int64

In [ ]:
# IMPORTANT: 
# Running apply on the Series will result in apply function on every value 
# Running apply on Dataframe will result in apply function on very Series in dataframe

### applymap()


This function is used to apply the function passed as parameter on every value of dataframe
- applymap() only works on dataframe
- Series objects does not have applymap()

In [101]:
# not running the apply map on full dataset, because it has integer values
data[["full_name", "city"]].applymap(len)

   full_name  city
0          5     8
1          3     5
2          7     6
3          5    13

In [130]:
data.applymap(lambda x: len(x) if (type(x) != int) else None)

   full_name   age  city
0          5  None     8
1          3  None     5
2          7  None     6
3          5  None    13

In [147]:
data[["age", "salary"]].applymap(np.square)

    age      salary
0   625   100000000
1  1024  1515098112
2   324 -1554869184
3  2209 -1859901888

In [148]:
data[["age", "salary"]].applymap(np.sqrt)

        age      salary
0  5.000000  100.000000
1  5.656854  346.410162
2  4.242641  353.553391
3  6.855655  324.037035

In [149]:
data[["age", "salary"]].applymap(np.sum)

# it will give us the same results without applying any sum function and we can only use np.sum function because, 
# python sum() does not work

   age  salary
0   25   10000
1   32  120000
2   18  125000
3   47  105000

## map() 
Map values of Series according to an input mapping or function.

Used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series

we give a dictionary in which we specify that what value we want to change with what, we pass the value to change in "key" and value into which change in "value"

In [154]:
data["name"].map({"Alice": "Converted_Alice"})

# Important point to notice here is, map functin gives NaN, if value doesnot found
# To overcome this issue we use replace function

0    Converted_Alice
1                NaN
2                NaN
3                NaN
Name: name, dtype: object

In [153]:
data

      name  age          shape  salary
0    Alice   25       New York   10000
1      Bob   32          Paris  120000
2  Charlie   18         London  125000
3    David   47  San Francisco  105000

## replace()

In [155]:
data["name"].replace({"Alice": "Converted_Alice"})

0    Converted_Alice
1                Bob
2            Charlie
3              David
Name: name, dtype: object

## Let's move on to the stackoverflow data

In [156]:
df["Hobbyu"].map()

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
3,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
4,5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88878,88377,NaN,Yes,Less than once a month but more than once per ...,The quality of OSS and closed source software ...,"Not employed, and not looking for work",Canada,No,Primary/elementary school,NaN,...,NaN,Tech articles written by other developers;Tech...,NaN,Man,No,NaN,NaN,No,Appropriate in length,Easy
88879,88601,NaN,No,Never,The quality of OSS and closed source software ...,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88880,88802,NaN,No,Never,NaN,Employed full-time,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88881,88816,NaN,No,Never,"OSS is, on average, of HIGHER quality than pro...","Independent contractor, freelancer, or self-em...",NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88882,88863,NaN,Yes,Less than once per year,"OSS is, on average, of HIGHER quality than pro...","Not employed, and not looking for work",Spain,"Yes, full-time","Professional degree (JD, MD, etc.)","Computer science, computer engineering, or sof...",...,Somewhat less welcome now than last year,Tech articles written by other developers;Indu...,18.0,Man,No,Straight / Heterosexual,Hispanic or Latino/Latina;White or of European...,No,Appropriate in length,Easy